app/Controllers/BeeklPlus.php

SELECT *
FROM `users`
WHERE `users`.`id` = '11'
---
    protected function isPremiumUser()
    {
        $session = session();
        if (!$session->has('id')) {
            return false;
        }

        $user = $this->userModel->find($session->get('id'));

UPDATE `users` SET `avatar_frame` = 'diamond'
WHERE `users`.`id` IN ('11')
---
    public function setAvatarFrame($frame = null)
    {
        if (!$this->isPremiumUser()) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'This feature is only available for BEEKL+ users'
            ]);
        }

        if (!$frame) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'No frame selected'
            ]);
        }

        $session = session();
        $this->userModel->update($session->get('id'), ['avatar_frame' => $frame]);