app/Controllers/Comment.php

INSERT INTO `comments` (`userID`, `postID`, `content`) VALUES ('3', '1', 'hello motto')
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `postID` = '1'
---
    public function addComment_atHomePage($id=null){
        //get postID
        $postModel = new PostModel();
        $data['postID']=$postModel->where('postID', $id);
        //add comment
        $commentModel = new CommentModel();
        $session = session();
        $userID = $session->get('id');
        $data = [
            'userID' => $userID,
            'postID' => $id,
            'content' => $this->request->getPost('content'),
        ];
        $commentModel->insert($data);
        //count comments
        $commentCount = $commentModel->where('postID', $id)->countAllResults();

SELECT *
FROM `comments`
WHERE `comments`.`commentID` = '23'
DELETE FROM `comments`
WHERE `commentID` IN ('23')
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `postID` = '1'
---
    public function deleteComment_atHomePage($commentID=null){
        // Get the comment model
        $commentModel = new CommentModel();

            // Find the comment to delete
            $comment = $commentModel->find($commentID);

            if ($comment) {
                // Get the postID from the comment
                $postID = $comment['postID'];

                // Delete the comment
                $commentModel->delete($commentID);

                // Update the comment count in the postforum table
                $postModel = new PostModel();
                $commentCount = $commentModel->where('postID', $postID)->countAllResults();