app/Controllers/Home.php

    public function index(): string
    {
        //Get Model
        $model = new PostModel();
        $commentModel = new CommentModel();
        $userModel = new UserModel();
        $session = session();
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));
        }
        //get all data from postforum and user
        $data['postforum'] = $model->join('users', 'users.id = postforum.userID')->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'
SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`



        //get all data from postforum with comments
        $data['comments'] = $model->select('postforum.*, COUNT(comments.commentID) as commentCount')
            ->join('comments', 'comments.postID = postforum.postID', 'left')
            ->groupBy('postforum.postID')
            ->findAll();
---
SELECT `postforum`.*, COUNT(comments.commentID) as commentCount
FROM `postforum`
LEFT JOIN `comments` ON `comments`.`postID` = `postforum`.`postID`
GROUP BY `postforum`.`postID`

    public function viewPost($titlePost = null){
        //Get Model
        $model = new PostModel();
        $userModel = new UserModel();
        //Get Session ID
        $session = session();
        $userID = $session->get('id');
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));
        }

        $userModel = new UserModel();
        $session = session();
        $userID = session()->get('id');
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));
        }
        $data['user'] = $user;

        //get all data from postforum with userID
        $data['postforum'] = $model
            ->join('users', 'users.id = postforum.userID')
            ->where('titlePost',$titlePost)
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`
WHERE `titlePost` = 'jquery-3.7.1.min.js'

        $data['trendingWords'] = $this->getTrendingWords();

        //get all data from postforum with comments
        $data['comments'] = $model->select('postforum.*, COUNT(comments.commentID) as commentCount')
            ->join('comments', 'comments.postID = postforum.postID', 'left')
            ->groupBy('postforum.postID')
            ->findAll();
---
SELECT `postforum`.*, COUNT(comments.commentID) as commentCount
FROM `postforum`
LEFT JOIN `comments` ON `comments`.`postID` = `postforum`.`postID`
GROUP BY `postforum`.`postID`