app/Controllers/Home.php

    public function index(): string
    {
        //Get Model
        $model = new PostModel();
        $commentModel = new CommentModel();
        //get all data from postforum and user
        $data['postforum'] = $model->join('users', 'users.id = postforum.userID')->findAll();
        //get all data from postforum with comments
        $data['comments'] = $model->select('postforum.*, COUNT(comments.commentID) as commentCount')
            ->join('comments', 'comments.postID = postforum.postID', 'left')
            ->groupBy('postforum.postID')
            ->findAll();
---
SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`
SELECT `postforum`.*, COUNT(comments.commentID) as commentCount
FROM `postforum`
LEFT JOIN `comments` ON `comments`.`postID` = `postforum`.`postID`
GROUP BY `postforum`.`postID`