app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'rianhadi@online.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('login_email');
        $password = $this->request->getVar('login_password');
        $data = $model->where('email', $email)->first();