app/Controllers/Notifications.php

SELECT *
FROM `notifications`
WHERE `userID` = '12'
ORDER BY `created_at` DESC
UPDATE `notifications` SET `isRead` = 1
WHERE `userID` = '12'
SELECT *
FROM `users`
WHERE `users`.`id` = '12'
---
    public function index()
    {
        $notificationModel = new NotificationModel();
        $userID = session()->get('id');
        $data['notifications'] = $notificationModel->where('userID', $userID)->orderBy('created_at', 'DESC')->findAll();

        //mark notifications as read
        $notificationModel->where('userID', $userID)->set(['isRead' => 1])->update();

        $userModel = new UserModel();
        $session = session();
        $userID = session()->get('id');
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));

SELECT *
FROM `notifications`
WHERE `type` = 'comment'
ORDER BY `created_at` DESC
---
    public function delete($notificationID)
    {
        $notificationModel = new NotificationModel();
        $userID = session()->get('id');

        // Verify notification belongs to the user
        $notification = $notificationModel->where('notificationID', $notificationID)->where('userID', $userID)->first();
        if ($notification) {
            $notificationModel->delete($notificationID);
            return redirect()->to('/notifications')->with('success', 'Notification deleted successfully.');