app/Controllers/Search.php

    public function searchAll_ByWords()
    {
        $request = service('request');
        $searchTerm = $request->getPost('search');

        $postModel = new PostModel();
        $userModel = new UserModel();
        //Get Session ID
        $session = session();
        $userID = $session->get('id');

        //search Post
        $data['postforum'] = $postModel
            ->like('titlePost', $searchTerm)
            ->orLike('content', $searchTerm)
            ->join('users', 'users.id = postforum.userID')
            ->where('userID', $userID)
            ->findAll();

        $data['users'] = $userModel->like('name', $searchTerm)
                    ->orLike('email', $searchTerm)
                    ->findAll();
---
SELECT *
FROM `users`
WHERE `name` LIKE '%test123%' ESCAPE '!'
OR  `email` LIKE '%test123%' ESCAPE '!'

    public function searchAll_ByTrendings($searchTerm = null){

        $postModel = new PostModel();
        //Get Session ID
        $session = session();
        $userID = $session->get('id');

        //search Post
        $data['postforum'] = $postModel
            ->like('titlePost', $searchTerm)
            ->orLike('content', $searchTerm)
            ->join('users', 'users.id = postforum.userID')
            ->where('userID', $userID)
            ->findAll();
---
SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`
WHERE `titlePost` LIKE '%test%' ESCAPE '!'
OR  `content` LIKE '%test%' ESCAPE '!'
AND `userID` = '12'

        $userID = session()->get('id');
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '12'