app/Controllers/SideMenu.php

INSERT INTO `likes` (`userID`, `postID`) VALUES ('7', '29')
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `postID` = '29'
SELECT *
FROM `users`
WHERE `id` = '6'
 LIMIT 1
---
    public function likePost($id=null)
    {

        //get postID
        $postModel = new PostModel();
        $data['postID']=$postModel->where('postID', $id)->first();

        //like post
        $likeModel = new LikeModel();
        $session = session();
        $userID = $session->get('id');
        $data = [
            'userID' => $userID,
            'postID' => $id,
        ];
        $likeModel->insert($data);

        //count likes
        $likeCount = $likeModel->where('postID', $id)->countAllResults();
        $postModel->update($id, ['likes' => $likeCount]);

        //return to the profile page with $name
        $session = session();
        $userID = $session->get('id');
        $userModel = new UserModel();
        $data['userID'] = $userModel->where('id', $userID)->first();