app/Controllers/Sort.php

SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`
WHERE `genre` = 'Olahraga'
---
    public function sortByGenre_atHomePage($genre = null){
        // Get the post model
        $postModel = new PostModel();
        // Get the user model
        $userModel = new UserModel();
        // Join the post model with the user model
        $data['postforum'] = $postModel ->join('users', 'users.id = postforum.userID')
                                        ->where('genre', $genre)
                                        ->findAll();

SELECT *
FROM `postforum`
JOIN `users` ON `users`.`id` = `postforum`.`userID`
WHERE `genre` = 'Anime'
AND `userID` = '6'
---
    public function sortByGenre($genre = null){

        //Get Session ID
        $session = session();
        $userID = $session->get('id');
        // Get the post model
        $postModel = new PostModel();
        // Get the user model
        $userModel = new UserModel();
        // Get Session ID
        $session = session();
        $userID = $session->get('id');
        // Join the post model with the user model
        $data['postforum'] = $postModel ->join('users', 'users.id = postforum.userID')
                                        ->where('genre', $genre)
                                        ->where('userID', $userID)
                                        ->findAll();