app/Controllers/Sort.php

        $userID = session()->get('id');
        $user = null;
        if ($session->has('id')) {
            $user = $userModel->find($session->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '12'