app/Views/dashboard_profile.php

SELECT *
FROM `likes`
WHERE `userID` = '6'
AND `postID` = '22'
 LIMIT 1
---
                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();

SELECT *
FROM `comments`
WHERE `postID` = '22'
---
                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();