app/Views/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '11'
AND `isRead` = 0
---
            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();

SELECT *
FROM `comments`
WHERE `postID` = '29'
---
                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
                                                foreach($comments as $comment) {
                                                    //get user data
                                                    $userModel = new \App\Models\UserModel();
                                                    $user = $userModel->find($comment['userID']);

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
                       <div class="d-flex justify-content-between align-items-center mb-3">
                           <div class="d-flex align-items-center">
                               <?php
                                    $postUser = $userModel->find($post['userID']);

SELECT *
FROM `likes`
WHERE `userID` = '11'
AND `postID` = '30'
 LIMIT 1
---
                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();

SELECT *
FROM `comments`
WHERE `postID` = '30'
---
                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '10'
---
                                                echo '<div class="comment-list">';
                                                foreach($comments as $comment) {
                                                    // Gunakan model yang sudah di-instance di atas
                                                    $commentUser = $userModel->find($comment['userID']);