app/Views/dashboard.php

            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '6'
AND `isRead` = 0

                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();
---
SELECT *
FROM `likes`
WHERE `userID` = '3'
AND `postID` = '1'
 LIMIT 1