app/Views/dashboard_profile.php

            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '6'
AND `isRead` = 0

                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();
---
SELECT *
FROM `likes`
WHERE `userID` = '6'
AND `postID` = '22'
 LIMIT 1

                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();
---
SELECT *
FROM `comments`
WHERE `postID` = '22'

                                                foreach($comments as $comment) {
                                                    //get user data
                                                    $userModel = new \App\Models\UserModel();
                                                    $user = $userModel->find($comment['userID']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'