app/Views/dashboard.php

SELECT *
FROM `likes`
WHERE `userID` = '3'
AND `postID` = '1'
 LIMIT 1
---
                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();

SELECT *
FROM `comments`
WHERE `postID` = '1'
---
                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
                                                foreach($comments as $comment) {
                                                    //get user data
                                                    $userModel = new \App\Models\UserModel();
                                                    $user = $userModel->find($comment['userID']);