app/Views/notifications_page.php

            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '10'
AND `isRead` = 0