app/Views/search_results.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '6'
AND `isRead` = 0
---
            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();