app/Views/sort_genre.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `userID` = '12'
AND `isRead` = 0
---
            <?php
                //count how many notifications from user
                $notificationModel = new \App\Models\NotificationModel();
                $notificationcount = $notificationModel->
                where('userID', session()->get('id'))
                ->where('isRead', 0)
                ->countAllResults();

SELECT *
FROM `likes`
WHERE `userID` = '12'
AND `postID` = '30'
 LIMIT 1
---
                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();

SELECT *
FROM `comments`
WHERE `postID` = '30'
---
                                            <?php
                                            // check comment count
                                            $commentModel = new \App\Models\CommentModel();
                                            $comments = $commentModel->where('postID', $post['postID'])->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '12'
---
                                            } else {
                                                echo '<div class="comment-list">';
                                                foreach($comments as $comment) {
                                                    $commentUser = $userModel->find($comment['userID']);